In [80]:
import pandas as pd
import pickle
import numpy as np

In [81]:
df = pd.read_csv("./realdata.csv")
df2 = pd.read_csv('./problemcorpus.csv')

In [82]:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [83]:
df2 = df2[:150]
df2['Unnamed: 0']+=1

In [84]:
df3 = df.merge(df2, left_on='qId', right_on='Unnamed: 0', how='outer')

In [85]:
df3.drop('Unnamed: 0', axis=1, inplace=True)

In [86]:
df3.to_csv('problem_id.csv')

In [87]:
df3 = pd.read_csv('./problem_id.csv')

In [88]:
df3

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.250000,The assets of Marble Faun Publishing Company ...
1,1,4,1,1.000000,The assets of Marble Faun Publishing Company ...
2,2,6,1,0.500000,The assets of Marble Faun Publishing Company ...
3,3,8,1,0.750000,The assets of Marble Faun Publishing Company ...
4,4,13,1,0.750000,The assets of Marble Faun Publishing Company ...
...,...,...,...,...,...
1928,1928,10,148,0.027778,In celebration of National Volunteer Appreciat...
1929,1929,11,148,1.000000,In celebration of National Volunteer Appreciat...
1930,1930,12,148,1.000000,In celebration of National Volunteer Appreciat...
1931,1931,13,148,0.857143,In celebration of National Volunteer Appreciat...
1932,1932,14,148,1.000000,In celebration of National Volunteer Appreciat...

In [89]:
df3['problem'] = df3['problem'].str.lower()

In [90]:
df3

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.250000,the assets of marble faun publishing company ...
1,1,4,1,1.000000,the assets of marble faun publishing company ...
2,2,6,1,0.500000,the assets of marble faun publishing company ...
3,3,8,1,0.750000,the assets of marble faun publishing company ...
4,4,13,1,0.750000,the assets of marble faun publishing company ...
...,...,...,...,...,...
1928,1928,10,148,0.027778,in celebration of national volunteer appreciat...
1929,1929,11,148,1.000000,in celebration of national volunteer appreciat...
1930,1930,12,148,1.000000,in celebration of national volunteer appreciat...
1931,1931,13,148,0.857143,in celebration of national volunteer appreciat...
1932,1932,14,148,1.000000,in celebration of national volunteer appreciat...

In [91]:
df3['problem'] = df3['problem'].str.replace(r'[!?\.\'\"\-\_\=\+\,\@\:\;\`\[\]\(\)\{\}\~\<\>\$0-9]',' ')
df3

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.250000,the assets of marble faun publishing company ...
1,1,4,1,1.000000,the assets of marble faun publishing company ...
2,2,6,1,0.500000,the assets of marble faun publishing company ...
3,3,8,1,0.750000,the assets of marble faun publishing company ...
4,4,13,1,0.750000,the assets of marble faun publishing company ...
...,...,...,...,...,...
1928,1928,10,148,0.027778,in celebration of national volunteer appreciat...
1929,1929,11,148,1.000000,in celebration of national volunteer appreciat...
1930,1930,12,148,1.000000,in celebration of national volunteer appreciat...
1931,1931,13,148,0.857143,in celebration of national volunteer appreciat...
1932,1932,14,148,1.000000,in celebration of national volunteer appreciat...

In [92]:
df3.to_csv('./noíŠ¹ìˆ˜.csv')

In [93]:
df3

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.250000,the assets of marble faun publishing company ...
1,1,4,1,1.000000,the assets of marble faun publishing company ...
2,2,6,1,0.500000,the assets of marble faun publishing company ...
3,3,8,1,0.750000,the assets of marble faun publishing company ...
4,4,13,1,0.750000,the assets of marble faun publishing company ...
...,...,...,...,...,...
1928,1928,10,148,0.027778,in celebration of national volunteer appreciat...
1929,1929,11,148,1.000000,in celebration of national volunteer appreciat...
1930,1930,12,148,1.000000,in celebration of national volunteer appreciat...
1931,1931,13,148,0.857143,in celebration of national volunteer appreciat...
1932,1932,14,148,1.000000,in celebration of national volunteer appreciat...

In [94]:
import nltk
import string
import fasttext
import contractions
from nltk.tokenize import word_tokenize
from nltk.corpus import stopwords, wordnet
from nltk.stem import WordNetLemmatizer

In [95]:
stop_words = nltk.corpus.stopwords.words('english')
new_words = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten', 'mr', 'ms', 'new', 'old', 'u', 'st', 'nd', 'rd', 'th']
stop_words.extend(new_words)

In [96]:
df3['problem'] = df3['problem'].apply(lambda x: [contractions.fix(word) for word in x.split()])

In [98]:
df3['problem'] = [' '.join(map(str, l)) for l in df3['problem']]
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,the assets of marble faun publishing company s...
1,1,4,1,1.00,the assets of marble faun publishing company s...
2,2,6,1,0.50,the assets of marble faun publishing company s...
3,3,8,1,0.75,the assets of marble faun publishing company s...
4,4,13,1,0.75,the assets of marble faun publishing company s...

In [99]:
df3['problem'] = df3['problem'].apply(word_tokenize)
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[the, assets, of, marble, faun, publishing, co..."
1,1,4,1,1.00,"[the, assets, of, marble, faun, publishing, co..."
2,2,6,1,0.50,"[the, assets, of, marble, faun, publishing, co..."
3,3,8,1,0.75,"[the, assets, of, marble, faun, publishing, co..."
4,4,13,1,0.75,"[the, assets, of, marble, faun, publishing, co..."

In [100]:
df3['problem'] = df3['problem'].apply(lambda x: [word for word in x if word not in stop_words])
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[assets, marble, faun, publishing, company, su..."
1,1,4,1,1.00,"[assets, marble, faun, publishing, company, su..."
2,2,6,1,0.50,"[assets, marble, faun, publishing, company, su..."
3,3,8,1,0.75,"[assets, marble, faun, publishing, company, su..."
4,4,13,1,0.75,"[assets, marble, faun, publishing, company, su..."

In [101]:
df3['problem'] = df3['problem'].apply(nltk.tag.pos_tag)
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
1,1,4,1,1.00,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
2,2,6,1,0.50,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
3,3,8,1,0.75,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
4,4,13,1,0.75,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."

In [102]:
df3['problem'] = df3['problem'].apply(lambda x: [(word, pos_tag) for word, pos_tag in x if pos_tag != 'NNP' and pos_tag != 'NNPS'])
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
1,1,4,1,1.00,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
2,2,6,1,0.50,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
3,3,8,1,0.75,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."
4,4,13,1,0.75,"[(assets, NNS), (marble, JJ), (faun, JJ), (pub..."

In [104]:
def get_wordnet_pos(tag):
    if tag.startswith('J'):
        return wordnet.ADJ
    elif tag.startswith('V'):
        return wordnet.VERB
    elif tag.startswith('N'):
        return wordnet.NOUN
    elif tag.startswith('R'):
        return wordnet.ADV
    else:
        return wordnet.NOUN
df3['problem'] = df3['problem'].apply(lambda x: [(word, get_wordnet_pos(pos_tag)) for (word, pos_tag) in x])
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[(assets, n), (marble, a), (faun, a), (publish..."
1,1,4,1,1.00,"[(assets, n), (marble, a), (faun, a), (publish..."
2,2,6,1,0.50,"[(assets, n), (marble, a), (faun, a), (publish..."
3,3,8,1,0.75,"[(assets, n), (marble, a), (faun, a), (publish..."
4,4,13,1,0.75,"[(assets, n), (marble, a), (faun, a), (publish..."

In [105]:
wnl = WordNetLemmatizer()
df3['problem'] = df3['problem'].apply(lambda x: [wnl.lemmatize(word, tag) for word, tag in x])
df3.head()

,Unnamed: 0,user_id,qId,answered_correctly,problem
0,0,1,1,0.25,"[asset, marble, faun, publishing, company, suf..."
1,1,4,1,1.00,"[asset, marble, faun, publishing, company, suf..."
2,2,6,1,0.50,"[asset, marble, faun, publishing, company, suf..."
3,3,8,1,0.75,"[asset, marble, faun, publishing, company, suf..."
4,4,13,1,0.75,"[asset, marble, faun, publishing, company, suf..."

In [106]:
df3.to_csv('problemlemmatized.csv')

In [111]:
df3 = pd.read_csv('problemlemmatized.csv')

In [112]:
df3.drop('Unnamed: 0', axis=1, inplace=True)

In [113]:
df3['problem']=df3['problem'].apply(lambda x: x.rstrip("]"))

In [114]:
df3['problem']=df3['problem'].apply(lambda x: x.lstrip("["))

In [116]:
df3['problem'] = df3['problem'].apply(lambda x: x.split(","))

In [117]:
df3['problem']= df3['problem'].apply(lambda x:[ i.strip(" ") for i in x])
df3['problem']= df3['problem'].apply(lambda x:[ i.strip("'") for i in x])

In [118]:
mylist = []
df3['problem']=df3['problem'].to_frame()
df3

,Unnamed: 0.1,user_id,qId,answered_correctly,problem
0,0,1,1,0.250000,"[asset, marble, faun, publishing, company, suf..."
1,1,4,1,1.000000,"[asset, marble, faun, publishing, company, suf..."
2,2,6,1,0.500000,"[asset, marble, faun, publishing, company, suf..."
3,3,8,1,0.750000,"[asset, marble, faun, publishing, company, suf..."
4,4,13,1,0.750000,"[asset, marble, faun, publishing, company, suf..."
...,...,...,...,...,...
1928,1928,10,148,0.027778,"[celebration, national, volunteer, appreciatio..."
1929,1929,11,148,1.000000,"[celebration, national, volunteer, appreciatio..."
1930,1930,12,148,1.000000,"[celebration, national, volunteer, appreciatio..."
1931,1931,13,148,0.857143,"[celebration, national, volunteer, appreciatio..."
1932,1932,14,148,1.000000,"[celebration, national, volunteer, appreciatio..."

In [124]:
df3.drop('Unnamed: 0.1', axis=1, inplace=True)

In [125]:
df3.to_csv('data.csv')